#Importing

In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
#creating path
path = r'C:\Users\TEDWI\OneDrive\Documents\Insta Cart Basket Analysis\02 Data\Prepared data\orders_wrangled.csv'

In [3]:
#importing orders dataset
df_ords = pd.read_csv(r'C:\Users\TEDWI\OneDrive\Documents\Insta Cart Basket Analysis\02 Data\Prepared data\orders_wrangled.csv', index_col= False)

In [4]:
#showing first 5 rows
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,hour_of_day_order_placed,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

In [5]:
#removing unanamed column 0
df_ords = df_ords.drop(df_ords.columns[0], axis = 1)

In [6]:
#showing new table
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,hour_of_day_order_placed,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [7]:
#number of rows and columns in orders data frame
df_ords.shape

(3421083, 6)

In [8]:
#creating path
path = r'C:\Users\TEDWI\OneDrive\Documents\Insta Cart Basket Analysis'

In [9]:
#reading data frame
df_ords_prior = pd.read_csv (r'C:\Users\TEDWI\OneDrive\Documents\Insta Cart Basket Analysis\01 Project Manager\order_products__prior.csv', index_col=False)

In [10]:
#showing data frame 
df_ords_prior.head ()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [11]:
#showing data frame rows and columns
df_ords_prior.shape

(32434489, 4)

 # Merging orders and order prior

In [12]:
#merging orders and orders prior data sets on order id columns
df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [13]:
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,hour_of_day_order_placed,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [14]:
#showing number of rows and columns in new data set
df_merged_large.shape

(32434489, 10)

In [15]:
#showing the type of merge
df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

#  Exporting Data As a Pickle

In [16]:
# Exporiting data as pkl

df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merge.pkl'))

In [17]:
import gc
gc.collect()

0

In [18]:

 
def limit_memory(maxsize): 
    soft, hard = resource.getrlimit(resource.RLIMIT_AS) 
    resource.setrlimit(resource.RLIMIT_AS, (maxsize, hard))